[
  {
    "article_url": "https://www.rappler.com/philippines/chinese-ships-gather-near-pag-asa-thitu-island-satellite-images/",
    "article_body": "Satellite images obtained by Reuters on Thursday, November 28, show a build-up of Chinese civilian vessels near contested Thitu Island, Manila’s key outpost in the South China Sea, but a senior Philippine navy officer said they are “not a cause for concern.” One of the images taken by Maxar Technologies on Monday and reviewed by Reuters shows about 60 vessels, some within 2 nautical miles of Pag-asa Island (Thitu Island), a strategically important island from which Manila monitors Chinese vessels and aircraft in the busy waterway. Vice Admiral Alfonso Torres, chief of the Philippines’ Western Command, said it was common for “maritime militia” ships to gather in the area. Manila, the Pentagon, and foreign diplomats say such vessels work with the Chinese coast guard and navy to strengthen Beijing’s presence in disputed waters. Rear Admiral Roy Trinidad, Philippine Navy spokesman for the South China Sea, also said maritime militia ships were regularly in the area, adding that Manila was aware of the vessels, which he called an “illegal presence”, but there was no need for alarm. “It’s not a cause for concern,” Trinidad said. “We don’t have to read every action and react to that… What is important for us is to maintain our posture.” Online ship trackers show that many of the vessels in the satellite photos are Chinese-registered fishing craft. The Chinese defense ministry did not immediately respond to a Reuters request for comment. China has never confirmed it has a militia of civilian vessels. The island, which the Philippines calls Pag-Asa, is Manila’s biggest and most strategically important in the disputed South China Sea, which is largely claimed by China and through which billions of dollars worth of goods pass each year. A 2016 ruling by the Permanent Court of Arbitration in the Hague found that Beijing’s expansive claims had no basis under international law. The build-up comes after months of clashes and rammings between Chinese coast guard and fishing vessels and Philippines ships, particularly at the Scarborough and Second Thomas Shoals. Thitu is close to a Chinese naval base and runway on Subi reef, which has sometimes served as a port for large numbers of Chinese maritime militia vessels, Trinidad said. “When you go in there (to Subi), when you go out, you will pass through the territorial sea of Pag-Asa,” he said. Regional diplomats and security analysts are watching developments closely, with some noting the Chinese vessels had their transponders on this week, allowing them to be tracked. Singapore-based security scholar Collin Koh said Beijing could be testing Manila’s reactions at a moment of domestic political tension in the Philippines. Embattled Philippine Vice President Sara Duterte on Wednesday accused President Ferdinand Marcos Jr of seeking to remove her from office, after the national police filed a formal complaint accusing her of assault and coercion. “This needs to be watched in the days ahead,” said Koh, of Singapore’s S. Rajaratnam School of International Studies. If the militia presence continues, Koh said, it could be that China is hoping to delay Philippine construction work on the island. A new aircraft hangar is reportedly due for completion in the next few weeks, the latest in a several moves to buttress the Philippines’ presence on Thitu and improve monitoring capabilities. – Rappler.com",
    "comments": "N, centers on independent analysis and is a piece about Filipino military officials detecting a build-up of Chinese vessels."
  },
  {
    "article_url": "https://news.abs-cbn.com/news/nation/2025/3/13/cidg-chief-admits-blocking-vp-sara-from-villamor-air-base-on-day-of-dad-rodrigo-s-arrest-1442",
    "article_body": "The chief of the police Criminal Investigation and Detection Group admitted Thursday that he denied Vice President Sara Duterte entry into Villamor Air Base before her father, former President Rodrigo Duterte, was brought to The Hague this week. CIDG chief MGen. Nicolas Torre noted that the elder Duterte was already with his lawyers at that time. \"Bakit kailangang dagdagan pa ang gulo?\" said Torre, who acted as ground commander during Duterte's arrest. Torre headed the Davao regional police before serving as CIDG chief. He also led the two-week operation to arrest controversial religious leader Pastor Apollo Quiboloy, a close ally of the Dutertes. Vice President Duterte said her father's arrest was an affront to the country's sovereignty and described it as \"state kidnapping.\" The Marcos administration rejected this allegation, saying the arrest was lawful because of an existing International Criminal Court warrant that was coursed through the International Criminal Police Organization or Interpol, of which the country is a member. Duterte insisted that the ICC lacked jurisdiction over the Philippines and the former president because of the withdrawal of the Philippines from the Rome Statute in 2019. The International Criminal Court took ex-President Duterte into custody Wednesday to face charges over his war on drugs. The ICC, based in The Hague, believes there are \"reasonable grounds\" to charge Duterte with murder as a crime against humanity, as an \"indirect co-perpetrator\" during the anti-drug campaign that rights groups estimate killed tens of thousands.  \"I am the one who led our law enforcement and military. I said that I will protect you and I will be responsible for all of this,\" Duterte said in a video posted to his and a close advisor's Facebook pages. \"I have been telling the police, the military, that it was my job and I am responsible,\" said the 79-year-old, the first Asian former head of state to appear before the ICC. A spokesman confirmed Duterte was in court custody after he arrived in Rotterdam by private jet. A vehicle thought to be carrying Duterte drove into the ICC detention center in The Hague past a crowd of dozens of supporters, some shouting: \"Bring him back\" and waving national flags. Duterte will be held there until an initial court appearance, likely in the coming days.",
    "comments": "SBA, because it mentions previous Government action on the Dutertes and allies, as well as Torre’s previous post in Davao. This creates framing that the Government is concentrating on efforts against the Dutertes and allies."
  },
  {
    "article_url": "https://www.rappler.com/philippines/marcos-jr-picks-lucas-bersamin-new-executive-secretary/",
    "article_body": "MANILA, Philippines – President Ferdinand Marcos Jr. appointed former chief justice Lucas Bersamin as his next executive secretary, more than a week after the embattled Victor Rodriguez resigned from this post. Press Secretary Trixie Cruz-Angeles confirmed Bersamin’s appointment on Tuesday, September 27, saying Bersamin had taken his oath before Marcos earlier in the day prior to attending the ninth Cabinet meeting. Bersamin, who retired from the SC in October 2019, turns 73 next month. Today we administered the oath of Former Chief Justice Lucas Purugganan Bersamin as the acting Executive Secretary of our administration. https://t.co/wxnRfxhuru Rodriguez served as executive secretary for less than three months, making him the shortest serving executive secretary in recent years. Rodriguez is now Marcos’ chief of staff. Before Malacañang confirmed Rodriguez’ resignation, word was going around that the President was looking for a new executive secretary, and that a former Supreme Court justice was among those being eyed. Bersamin’s 10-year stint in the High Court had been marked by controversial ponencias and concurring votes, including the acquittal of former president Gloria Macapagal-Arroyo and the bail grant to plunder defendant Juan Ponce Enrile, now Marcos’ chief legal adviser. Bersamin’s bail grant favoring Enrile, in particular, had been based on humanitarian considerations because of old age and was later cited by the anti-graft court Sandiganbayan in keeping Imelda Marcos free despite conviction for seven counts of graft. He was also one of the nine Supreme Court justices who voted to allow a hero’s burial for the late dictator Ferdinand E. Marcos in 2016. Before leaving the SC, Bersamin said he wanted to be remembered as a “healing chief justice,” a reference to the controversial quo warranto case against former chief justice Maria Lourdes Sereno that had rocked the judiciary. (READ: Chief Justice Bersamin’s philosophy: Restraint in favor of government) Appointed to the Court by Arroyo in 2009, Bersamin came from the Court of Appeals, and before that, was a judge at the Quezon City Regional Trial Court (RTC). He earned his law degree from the University of the East and joined the bar after taking the 9th spot in the 1973 Bar Examinations. He obtained his undergraduate degree in Political Science at the University of the Philippines Diliman in 1968. – Rappler.com",
    "comments": "BA, this is due to the exhaustive history of the newly appointed Bersamin, which includes favorable rulings of close family members and cabinet members of Marcos during his Supreme Court stint. It creates a narrative that Bersamin’s appointment stems from his loyalty or favorability to the President’s family and friends."
  },
  {
    "article_url": "https://newsinfo.inquirer.net/2059231/doj-chief-imee-marcos-raps-over-duterte-arrest-a-bit-strange",
    "article_body": "Justice Secretary Jesus Crispin Remulla on Wednesday questioned the Ombudsman’s procedures in ordering him and several officials to respond to criminal and administrative complaints over the arrest of former President Rodrigo Duterte, while also casting doubt on the filing made by the Senate committee on foreign relations. “It seems the procedure isn’t clear because, before, there was a fact-finding process and rules that were published. This time, it’s like there was no fact-finding at all, it went straight to us,” Remulla told reporters in an interview at the Department of Justice (DOJ). Despite these concerns, he said he would comply with the directive and submit his counteraffidavit. In two separate orders issued by the Office of the Ombudsman on Tuesday, Remulla and his brother, Interior Secretary Jonvic Remulla, along with Philippine National Police chief Gen. Rommel Marbil, PNP Criminal Investigation and Detection Group chief Nicolas Torre III, and Special Envoy for Transnational Crimes Markus Lacanilao, were ordered to submit their counteraffidavits within 10 days, along with their witnesses’ affidavits. This is after the Senate committee on foreign relations headed by Sen. Imee Marcos, filed a complaint against them over the March 11 arrest of Duterte and his turnover to the custody of the International Criminal Court (ICC) in The Hague. Echoing the DOJ’s reply to the petitions filed with the Supreme Court over the former president’s arrest, Remulla said the government did not violate the law when it helped in the arrest of Duterte and his handover to The Hague to face charges of crimes against humanity for his bloody war on drugs. “We will respond to every issue, that everything that happened was within legal bounds, all of it was according to the law,” Remulla said. The DOJ chief also questioned the complaint, as he criticized the timing of the filing. “It’s actually the complaint itself. I found it a bit strange; it’s not even a committee report. Why the haste? Why not wait for the committee report, since that’s [the result of] the committee’s investigation? What was contained was the chairman’s report; that’s a little strange,” Remulla said. “Once the election is over, that should be the end of it, because it seems like [the investigation] was just in aid of getting publicity for the elections,” he added.",
    "comments": "N. There is no particular wording that implies favorability to either side, and the article mostly uses comments from the individuals involved."
  },
  {
    "article_url": "https://news.abs-cbn.com/video/news/01/26/24/3-lto-employees-arrested-for-stealing-license-plates",
    "article_body": "Three Land Transportation Office employees were arrested Thursday after they were caught stealing license plates from the agency’s plate making plant in Quezon City. LTO Chief Assistant Secretary Atty. Vigor D. Mendoza II identified the 3 as embossers Jenard Arida and Arjay Anasco; and warehouse staff Valeriano Nerizon, all assigned to the plate making plant at the LTO Central Office in Quezon City. Mendoza also ordered a manhunt against Allan Joker Abrigo, another LTO employee who served as team leader and possibly the boss of the three arrested suspects. \"Gaya ng ipinangako natin sa taumbayan, we will not tolerate this kind of illegal activity and we will make sure that those who would dare to continue with their wrongdoings will be caught and held responsible. The arrest of these three people is proof of that,\" the LTO chief said. The investigation started after the LTO Intelligence and Investigation Division led by Renante G. Militante received information last year about possible theft of license plates. The investigation showed the three suspects were allegedly threatening their co-workers in the plate making plant if they would spill the beans on their modus. On Jan. 25, Militante was tipped that the three were again doing illegal activity, prompting him to contact Police Col. Bernard Yang, Senior Police Assistant to Interior and Local Government Secretary Benhur Abalos. A PNP operation led to the arrest of the three suspects while sneaking out five pieces of license plates out of the plant Thursday noon. “Based on the result of the investigation, they are selling the license plates at P10,000 per piece. We are now trying to determine how long and how many license plates have been stolen by these errant employees,” said Mendoza. \"There is a syndicate behind these people involved in carnapping, smuggling and other serious crimes. We will run after the mastermind and the buyers. It appears na matagal na itong embedded at the LTO. More employees will be investigated as part of our weeding out of scalawags,\" he added. The suspects are now detained and are facing charges of Violation of Article 310 (Qualified Theft) and Article 294 (Robbery) of the Revised Penal Code. They will also face administrative charges. Technical Carnapping Based on the investigation, the 3 are being linked to a scheme involving newly-acquired motor vehicles through financing. The modus starts with a leader or a financier who will acquire a vehicle through financing and will illegally sell the vehicle using duplicated plates and fake OR/CR. The financier then procures the \"fake\" plates from his contact inside LTO at P20,000 per pair. ",
    "comments": "N, aside from the statement about Allan Joker Abrigo, no other sentence, phrase, or word hints at support for either party."
  },
  {
    "article_url": "https://newsinfo.inquirer.net/1813075/govt-eyes-p16-billion-funding-for-school-meals",
    "article_body": "Next year’s proposed funding for the feeding of children of P15.795 billion is 45 percent higher than this year’s P10.89 billion and may mean 857 million meals for nutritionally deficient kids. “Never has the budget for child feeding been supersized to this big. On this, the government has put its money where its mouth is,” House Deputy Speaker and Batangas Rep. Ralph Recto said over the weekend, noting that the program was “unprecedented.” A check of the 2024 National Expenditure Program showed that the Department of Education (DepEd) requested P11.711 billion for its school-based feeding program, while the Department of Social Welfare and Development (DSWD) asked for P4.084 billion for its supplementary feeding program. These sums are higher than the P5.69 billion and P5.2 billion approved for these programs under the 2023 spending law. The proposed funding for feeding programs for kids in 2024 is P4.9 billion higher than this year’s approved allocations. Recto said the P15.795 billion may translate to 857 million meals for nutritionally deficient children, at current prices. “Costing for 2024 might still be adjusted to inflation, but it will not change the fact that the two agencies will have in their hands a big catering operation next year,” he said. Recto cited data from the two agencies, which showed that for 2023, the DepEd will provide 1,678,704 students one meal a day for 120 days, while DSWD will serve one meal for 120 days to 1,754,637 beneficiaries. The DepEd’s school-based feeding program caters to students from Kindergarten to Grade 6 who come from indigent families and are suffering from child wasting or stunting. On the other hand, the DSWD’s supplemental feeding program is for children aged 3 to 5 years old who are placed in daycare and other child development centers. Recto said the increase in the budget for school-based feeding should be accompanied by higher funding for food preparation and handling facilities, cooking equipment, and canteens. “Procuring more of these serves a dual purpose as these facilities can become teaching laboratories for senior high students taking culinary classes under the technical-vocational track. They can feed the body and feed the mind at the same time,” he said. He added that the P15.795 billion funding for the two agencies may also help local farmers and food producers if schools will buy from them. “In essence, it is a food purchase budget, which can be spent locally, resulting in a virtuous cycle wherein food grown by the village will end up being consumed by their children,” Recto added.",
    "comments": "SBF, the article begins with a statement by the government which is only later mentioned to be from a government official, and clarified with additional context."
  },
  {
    "article_url": "https://www.gmanetwork.com/news/topstories/nation/853005/security-foreign-relations-experts-push-for-diplomacy-in-west-philippine-sea/story/",
    "article_body": "Top national security and foreign relations experts underscored the importance of dialogue and diplomacy in resolving disputes and preventing war in the West Philippines Sea (WPS). “I think [President Ferdinand \"Bongbong\" Marcos Jr.] has paved the way for that future trajectory of where we're going. So, he's saying, 'Let's just continue dialoguing, constructive dialogue, and the like, and diplomacy,'” National Security Adviser Clarita Carlos said in a statement. Carlos said, “You don’t choose. Play smart. Define what your goals are as a nation. Play your game well. This is now a new Philippines. A newfound confidence about who we are.” For her part, former Ambassador and former Foreign Affairs Undersecretary Rosario Manalo also said that diplomatic solutions are the way to prevent escalation of the present state of affairs. “The value of diplomacy when it comes to the blue economy is to prevent war. War brings about the end of our existence,” Manalo said. “There are three modes of settling disputes. The first one is called the diplomatic process… the second is through legal action… and the third is through arbitration,” the former ambassador said. Likewise, former Philippine National Police (PNP) General and now Baguio City Mayor Benjamin Magalong lamented that his city has been “impacted indirectly by the ongoing issue of the West Philippine Sea.” “The only way we will be able to resolve the issue is through dialogue, constant dialogues, low-key dialogues. Besides, our only objective there is to allow our fishermen to go to that area and proceed with their livelihood. And second, probably a joint exploration on the oil. There was a study made by the US Geological Survey stating therein that there are about a billion barrels of oil and trillion natural gas in the West Philippine Sea,” Magalong said. Former Defense Secretary Gilbert Teodoro, for his part, said that it takes a “lot of skilled diplomacy to solve that, but one thing is undeniable - the livelihood of our fisherfolk is primary because this is survival for them.” Teodoro said that “multilateralism basically is really important in the sense that it prevents a stronger country, in theory, from bullying a smaller one. Now, having a bilateral approach would mean the more powerful one will prevail.” “So, the balance will be we continue to develop our capabilities in creating a credible deterrent against expansionism, but we continue to pursue those activities which can redound mutually to the benefit of our interests of both people, particularly economically,” Teodoro said.",
    "comments": "SBF, due to usage of the term “West Philippine Sea” and general reliance on Philippine Government statements on an ambiguous issue."
  },
  {
    "article_url": "https://qa.philstar.com/nation/2406876",
    "article_body": "Funds with no specific allocation in the proposed 2025 national budget remain significant, as the bicameral conference committee earlier this week added another P373 billion to the executive branch's initial proposal. The National Expenditure Program, which outlines the executive branch's proposed budget, initially requested P158.6 billion in what officials call \"unprogrammed funds.\" However, at the bicameral conference of both chambers of Congress, increased this amount by P373 billion, bringing the total to P531.66 billion. Unprogrammed funds are defined by the Department of Budget and Management (DBM) as allocations without guaranteed funding.Funds are only allocated for the project when the government secures additional resources or revenues. This is not the first time Congress has approved a higher amount of unprogrammed funds than requested by the Executive branch. In 2024, unprogrammed funds reached a staggering P731.44 billion, making it the second-highest allocation for such items since 2016, surpassed only by the 2023 budget. For 2024, the NEP initially sought P282.9 billion in unprogrammed funds, but Congress increased this by P449.5 billion—a move that drew criticism from opposition lawmakers. Key projects, including major transportation initiatives and military modernization efforts, were unexpectedly placed under unprogrammed funds, surprising some legislators. In a chance interview on Wednesday, December 12, Senate budget sponsor Sen. Grace Poe commented on the reduced scale of unprogrammed funds for 2025 compared to previous years. “Our unprogrammed funds are not like before when many items were placed under it. Now, it is lower,” Poe said. If approved, 2025 would mark the fourth consecutive year that Congress has increased unprogrammed funds beyond what was requested by the Executive branch. Previous allocations In recent years, Congress has consistently raised unprogrammed fund allocations: For 2022, Congress increased the Executive's request of P151.63 billion to P251.63 billion. For 2023, Congress raised unprogrammed funds to P807.16 billion from the NEP’s original request of P588.162 billion. The DBM has previously explained that categorizing items under unprogrammed funds does not indicate they are low priority. Instead, these projects may lack certain requirements such as complete documentation or finalized loan agreements. Philstar.com has reached out to both DBM and House budget sponsor Ako Bicol Partylist Rep. Elizaldy Co for comments and will update this story once they respond.",
    "comments": "N, mostly explains that the budget allocated to the DBM is consistently higher due to no fault of that department."
  },
  {
    "article_url": "https://newsinfo.inquirer.net/1960295/70k-census-takers-to-be-deployed-starting-july-15",
    "article_body": "President Ferdinand Marcos Jr. has declared July as National Census and Community-based Monitoring System Month in support of the nationwide census to be conducted starting July 15. The Philippine Statistics Authority (PSA) said it would begin deploying 70,000 enumerators beginning on Monday to conduct a population census. In Proclamation 627 dated July 9, Mr. Marcos urged the public to cooperate with the PSA and “provide truthful and complete information in response to census questions, subject to existing laws, rules and regulations.” He stressed the importance of the census as it “equips government executives, policymakers and planners with current and comprehensive population data to develop informed social and economic development plans, policies and programs.” The President earlier called for a census update on the list of beneficiaries in the government’s social protection programs. The update will be done through the PSA’s community-based monitoring system, which will be integrated with the Census of Population ahead of the original schedule in 2025. The last census was done in May 2020, which revealed that the country’s population at the height of the COVID-19 pandemic was 109,035,343. The figure was higher by 8.05 million compared with 2015’s population of 100.98 million. Executive Order No. 352, issued in 1996, mandated the conduct of nationwide censuses and surveys every five years and the maintenance of administrative-based records regularly. Proclamation No. 627, on the other hand, tasked the National Economic and Development Authority and PSA to lead, coordinate, and supervise activities concerning the observance of the National Census and Community-Based Monitoring System Month.",
    "comments": "N, it simply reports on census, its processes, and a new one being undertaken."
  },
  {
    "article_url": "https://qa.philstar.com/nation/2296133",
    "article_body": "The Department of Health (DOH) yesterday clarified that not all of the P7.4 billion worth of drugs tagged by the Commission on Audit (COA) have expired. “Only 0.03 percent were found to have actually expired while only 1.16 percent are near expiry,” the DOH reported. Most of the expired medicines, DOH said, are stocks in government-run hospitals, which were unutilized due to the lower number of patients going to hospitals fearing COVID-19, while the rest were in DOH regional offices, which remained undistributed due to refusal to accept new stocks, citing sufficiency of existing inventory. The DOH explained that the COA findings focused on the proper disposal of expired drugs and medicines and not on expiration per se, noting that the concerned hospitals and health facilities were able to justify the causes of the expiration, but those were not highlighted in the audit. Some 95.81 percent of the cited amount is not expired and only pertains to slow moving, undistributed or overstocked inventories, the DOH said. Concerning the slow-moving inventories, DOH said that 86 percent have been distributed to centers for health development and other health facilities. The remaining 14 percent of the inventories tagged as slow-moving/undistributed/overstocked are scheduled to be delivered in the last quarter of 2023. Health Secretary Ted Herbosa previously ordered the creation of an asset management task force in the DOH to ensure that issues like these are planned for, immediately addressed and prevented. Bivalent doses Over 13,000 doses of bivalent COVID-19 vaccines are still available for eligible population, the DOH said. As of Sept. 8, DOH said, a total of 13,394 bivalent doses are yet to be used. About half of the remaining doses are allocated in the Bicol region (2,607), Calabarzon (2,354) and Mimaropa (2,223). The Bangsamoro Autonomous Region in Muslim Mindanao still has 1,630 doses while the National Capital Region has 1,137. Of the 388,980 bivalent vaccines donated by the Lithuanian government, 366,561 doses have been used. “(This) accounts for 94.23 percent of the allocated vaccines from the Lithuanian government,” the DOH noted.",
    "comments": "N, the wording used does not insinuate any sort of mismanagement or fault of the populace regarding expired medicine."
  },
  {
    "article_url": "https://newsinfo.inquirer.net/2011737/lawmakers-urge-vp-go-to-both-house-nbi-probes",
    "article_body": "Neophyte House lawmakers on Monday advised Vice President Sara Duterte to attend both the congressional inquiry into her alleged misuse of public funds and the National Bureau of Investigation’s probe of her supposed kill threat against President Marcos. At a press conference on Monday, 1-Rider party list Rep. Ramon Rodrigo Gutierrez stressed that both the inquiry by the House committee on good government and public accountability and the NBI investigation were legal processes requiring compliance. The NBI earlier required Duterte to appear before it on Nov. 29 to explain her “active threat” to have Marcos, his wife Liza and Speaker Martin Romualdez assassinated should she be killed. But this was moved by the NBI to Dec. 11 after she asked for it to be rescheduled, saying she wanted to attend the House hearing set on Nov. 29. However, the House panel, which is looking into allegations that over P600 million in funds given to the Office of the Vice President and Department of Education were misused from 2022 to 2023, called off its hearing to avoid any conflict with Duterte’s NBI appearance. “I don’t understand why it would be easier to commit to one and not the other,” Gutierrez said. He was referring to Duterte’s statement that she would choose appearing before the House panel chaired by Manila Rep. Joel Chua over abiding by the NBI summons. “I think she should commit to both because these are both legal processes that have to be complied with ... I hope that’s what she does,” Gutierrez said. Assistant Majority Leader and Lanao del Sur Rep. Zia Adiong, on the other hand, pointed out that Duterte’s appearance in both proceedings was only “proper and was how an official respects the rule of law.” “It’s not really a matter of choice. I think it’s proper, and it’s how an official respects the rule of law,” Adiong said, adding that the Vice President should deal squarely with the NBI probe. “So it’s not really a choice between which do you favor: the committee hearing or the NBI. Both are important,” he pointed out. For her part, Assistant Majority Leader Amparo Maria Zamora slammed Duterte’s claim that the presidency was already hers in 2022, saying, “Then why didn’t she run if she had it in the bag? I mean, it’s already [almost] 2025, why is she just saying that now?”",
    "comments": "BA, Specifically against Sara Duterte, part of the Executive, it implies that there is a lot of conflict and suspicious events occurring involving Sara Duterte."
  },
  {
    "article_url": "https://www.rappler.com/philippines/things-to-know-marcos-jr-trips-canberra-melbourne-australia-2024/",
    "article_body": "President Ferdinand Marcos Jr. will visit Australia not once but twice within a seven-day period from the last week of February to the first week of March. The first trip will be a state visit, while the second one will be for his participation in a special summit of the Association of Southeast Asian Nations (ASEAN). Here’s what you need to know. Department of Foreign Affairs (DFA) spokesperson Teresita Daza said on Tuesday, February 27, that Marcos will be in Canberra from Wednesday to Thursday, February 28 to 29, as a guest of the Australian government, upon the invitation of Australian Governor-General David Hurley. He will deliver a speech before the Australian Parliament during his time there, joining other heads of state who have addressed the country’s legislative body in the past – the United States’ Barack Obama and George W. Bush, China’s Xi Jinping, Britain’s Tony Blair, Japan’s Shinzo Abe, and Indonesia’s Joko Widodo. “He is expected to convey a shared vision and future with Australia under the ambit of the strategic partnership and informed by common history, long-standing people-to-people ties, and mutual adherence to the rules-based order and international law,” Daza said. Marcos will also sit down with senior Australian officials to discuss defense and security, trade and investments, multilateral cooperation, and regional issues, according to a press release of the Presidential Communications Office (PCO) on Saturday, February 24. “Similarly, the visit will witness the signing of new agreements in areas of common interest to complement the already robust cooperation with Australia and expand engagements for mutual capacity-building,” the PCO release also read. Marcos will fly home to the Philippines after his two-day state visit. Four days later, Marcos will again be back in Australia, but in a different city. Marcos will mingle with other Southeast Asian leaders in Melbourne for the ASEAN-Australia Special Summit, an event that will commemorate 50 years since the regional bloc established formal relations with its oldest dialogue partner. His schedule is as follows: The South China Sea dispute is also expected to be raised during the summit. According to the DFA, the President himself may thank the Australian government for continuously recognizing the 1982 United Nations Convention on the Law of the Sea and the 2016 arbitral award that ruled in favor of the Philippines and against China’s all-encompassing claim over the vast waterway. The DFA said documents that are expected to be produced from the summit include: The Philippines will also hold bilateral talks with Cambodia and New Zealand. Manila will take part in these organized working-level events as well: There are 408,000 Filipinos in Australia as of 2022, making the migrant community the fifth largest in the Land Down Under. – Rappler.com",
    "comments": "SBA, the list of items is not relevant even though it was cut off, but the introduction is sensationalist and makes the double visitation seem exorbitant, even if it is perfectly reasonable as mentioned later on."
  },
  {
    "article_url": "https://news.abs-cbn.com/news/12/26/23/5-days-before-deadline-govt-firm-no-extension-for-puv-consolidation",
    "article_body": "The government remains firm in its stand not to extend the deadline for the consolidation of operators to comply with the jeepney modernization program. Transportation Undersecretary Timothy John Batan on Tuesday said there will be no more extension beyond the December 31 due date, despite appeals from drivers and operators to give them more time to comply with the policy. However, many jeepney drivers and operators remain hesitant to join a cooperative or corporation. Under a cooperative, an operator will lose ownership of his unit as this will now form part of the asset of the group that formed the juridical entity. A driver interviewed by ABS-CBN said his job as a driver is now hanging in the balance, 3 days before the last office day of the Land Transportation Franchising and Regulatory Board (LTFRB) for this year. Another driver and jeepney operator, meanwhile, said he is not willing to give up ownership of his unit which he bought for P90,000. HOPE AND APPEAL Transport group Piston remains hopeful that a temporary restraining order [TRO] will be issued by the Supreme Court after it brought the issue to the highest court. Manibela, on the other hand, appealed for compassion from President Ferdinand Marcos Jr. for the plight of drivers and operators who will lose their livelihood once the LTFRB suspends their operation come January 2024. Manibela said there are still around 40,000 traditional jeepney units that have yet to join the consolidation. When asked about the veracity of the figure, the Department of Transportation said they cannot yet dispute it, pending the LTFRB updating its record. But the DOTr said the LTFRB will issue special permits to plug the expected shortage of jeepneys in several routes in Metro Manila. Dispatching buses will be an option to ferry more passengers who are going to be affected by the shortage of traditional jeepneys, in case the impasse between Manibela/Piston and LTFRB is not resolved, the transport department said.",
    "comments": "SBA, repetitive usage of statements involving plight or loss due to Government actions, even if true, creates a picture in which the Government seems oppressive."
  },
  {
    "article_url": "https://www.rappler.com/philippines/former-speaker-alvarez-on-demotion-arroyo-resignation-sara-duterte/",
    "article_body": "Amid the demotion of former President Gloria Macapagal Arroyo from her post in the House of Representatives and the resignation of Vice President Sara Duterte from the LAKAS-CMD party, former speaker Pantaleon Alvarez said the Filipino people should closely watch the political bickerings in the capital as he expects “more fireworks” in the coming days. “Talagang makiramdam din tayo dahil nasa exciting times tayo. Palagay ko, maraming mangyayari pa ring mga fireworks dyan. Syempre, hindi maiiwasan. (Let’s be watchful because we are in exciting times. I think more things will happen. More fireworks maybe. These cannot be avoided.),” Alvarez told Bombo Radyo Philippines on Tuesday, May 23. Asked whether he thinks the ongoing House intramurals will lead to the ouster of Speaker Martin Romualdez, like what happened to him when then Davao City Mayor Sara Duterte succeeded in ousting him as Speaker, Alvarez, replied: “Sa totoo lang, hindi, hindi. Wala pong mangyayari. Talagang mananatili yung Speaker sa pwesto nya. (It will never happen to Speaker Romualdez. He will remain as Speaker of the House.)” He said the reason is the closeness of Speaker Romualdez and his cousin President Ferdinand Marcos Jr. Alvarez, the representative of the 1st District of Davao del Norte, refused to speculate on why Vice President Sara Duterte left her political party LAKAS-CMD. “Sa ngayon, mahirap mag speculate, pero definitely cause and effect yan,” Alvarez said. (It’s hard to speculate, but definitely this a cause and effect.) Duterte, in her resignation letter, said she “cannot be poisoned by political toxicity or undermined by execrable political powerplay.” – Rappler.com",
    "comments": "SBA, it is simply speculation and comments on political shakeups involving the President and Vice President, as well as their allies in Congress. However usage of words like political bickerings may have undue influence that implies inefficiencies and distrust in government."
  },
  {
    "article_url": "https://newsinfo.inquirer.net/1661973/dti-to-launch-text-advisory-for-consumers",
    "article_body": "MANILA, Philippines — The Department of Trade and Industry (DTI) will launch a text blasting facility to spread information needed by consumers such as suggested retail prices and advisories. Trade Undersecretary Ruth Castelo, head of DTI’s consumer protection group, said on Saturday, that the public can subscribe to this program. “All of our advisories, notices, invitations on the activities of the consumer protection group, they will receive that,” Castelo said. She said mobile phone users can subscribe via Smart Communications, Globe Telecom, and DITO Telecommunity. Smart users can text “SUBSCRIBE 1-384” and send it to 09603544154. Users of other networks can send to 0966-9784816 or 0919-1602303.",
    "comments": "N, it is an informative piece. Text blasting is not negative and it is simply a type of facility."
  },
  {
    "article_url": "https://www.rappler.com/philippines/philippines-ban-trans-fat-prepackaged-processed-food-products-june-19-2023/",
    "article_body": "The use of trans fat in prepackaged processed food products is now banned in the country starting Monday, June 19. Based on the orders issued by the Department of Health (DOH) and the Food and Drug Administration (FDA) in 2021, processed food products containing trans fatty acids are prohibited from being manufactured, imported, and distributed for commercial sale after June 18. The FDA said that all product formulations and labels of prepackaged processed food containing trans fat must be fully compliant with their guidelines. This policy was implemented to address the high consumption of trans fat, which increases the risk of developing coronary heart disease and other diseases. Foods like margarine, coffee creamer, and baked goods such as donuts and cookies are typically rich in industrial trans fat, according to the World Health Organization. “Trans fats are the source of our problem for noncommunicable diseases: hypertension, obesity, stroke. Many countries have already banned it, so it’s our turn,” DOH Secretary Ted Herbosa said. According to the DOH, about 3,000 Filipinos suffer yearly from premature mortality related to the high consumption of trans fat. On Monday, health advocates from different sectors launched Bantay Kontra Trans Fat as an initiative to make sure that food manufacturers will comply with the DOH and FDA’s programs to eliminate trans fat. “We have to remain vigilant, empower consumers, and foster compliance,” said Sophia San Luis of public interest group ImagineLaw. She said they will conduct a nationwide literacy campaign in reading packages and labels of food products and educate consumers on the dangers of other sources of trans fats. To report possible noncompliance of food manufacturers to the DOH and FDA orders, San Luis said the public may message the Trans Fat Free Philippines’ Facebook page. Violation of any of the provisions of the administrative order and the FDA circular would be grounds for the disapproval, suspension, or cancelation of the certificate of product registration of concerned food manufacturers.",
    "comments": "SBF, the inclusion of health advocates in the article to support the Government program while lacking inclusion of industry participants who may be affected indicates some support for the initiative."
  },
  {
    "article_url": "https://www.gmanetwork.com/news/scitech/science/940146/up-researchers-develop-pansit-pansitan-tablet-for-gout-treatment/story/",
    "article_body": "Researchers from the University of the Philippines Manila have developed a gout medication made of ulasimang bato, also known as pansit-pansitan. The drug, which comes in tablet form, has been shown to reduce uric acid levels in patients with gout, which is a common form of arthritis. ''Their clinical trials demonstrated a progressive reduction in uric acid levels among participants, with a 40% decrease observed by Day 14. This reduction continued, reaching up to 63% by Day 28 and up to 78% by Day 49,'' UP Manila said in an article posted on its website. ''Notably, no adverse effects were reported, in contrast to conventional gout treatments that may pose risks to kidney and liver health.'' The DOST's Philippine Council for Health Research and Development said in a separate article that the researchers found that the ideal dosage should be set at 80 mg/kg/day at first, and then lowered to 40 mg/kg/day after two weeks. Jade Rodriguez, one of the research proponents from the UP Manila Institute of Herbal Medicine of the National Institutes of Health, said the findings showed that ulasimang bato (Peperomia pellucida) ''has powerful anti-inflammatory and anti-hyperuricemia properties.'' ''It could be a safer, more natural way for Filipinos to manage gout without the risks linked to synthetic drugs,” he added. Gout affects some 1.6 million Filipinos, according to the Philippine Rheumatology Association. Its symptoms include ''sudden, severe attacks of pain, swelling, redness and tenderness in one or more joints, most often in the big toe,'' the Mayo Clinic said. According to UP Manila, efforts are underway to make the pansit-pansitan tablet accessible to the public. ''The university’s Technology Transfer and Business Development Office (TTBDO) is looking for partners to help bring this herbal medicine to market,'' it said.",
    "comments": "N, it reports on a breakthrough by UP which in collaboration with DOST PCHRD"
  },
  {
    "article_url": "https://newsinfo.inquirer.net/1891583/dot-dmw-ready-free-tourism-training-for-ofws-families",
    "article_body": "Returning overseas Filipino workers (OFWs) will soon have a chance to avail themselves of free tourism-related trainings as the Department of Migrant Workers (DMW) and the Department of Tourism (DOT) on Thursday launched the government’s “Balik Bayani sa Turismo” program. The project, which will start in May, will provide training in culinary tourism, retail business, farm tourism, homestay operations and as tour guides, among others. Tourism Secretary Christina Garcia Frasco said, “OFWs are the best tourism ambassadors for the Philippines, not just by way of words to promote the country, but more importantly, by way of their work through their dedication to duty, always putting forth the best foot forward for the Philippines.” Under the memorandum of understanding, they have committed to give training that covers livelihood, entrepreneurship, savings, investments and financial literacy opportunities for OFWs and their families.",
    "comments": "BF, the article leans heavily into positive outcomes and benefits of a tourism program."
  },
  {
    "article_url": "https://news.abs-cbn.com/news/11/14/23/3rd-batch-of-filipinos-from-gaza-arrives-in-ph",
    "article_body": "The third batch of Filipino nationals from Gaza arrived at Ninoy Aquino International Airport Terminal 3 on Tuesday afternoon. This batch is composed of four families, including 14 Filipinos and their six Palestinian spouses. They were welcomed by officials from the Department of Foreign Affairs, Overseas Workers Welfare Association, Department of Social Welfare and Development, and the Department of Health. Ravelina Cargullo was among those who arrived. She shared how the deteriorating situation in Gaza led them to flee, saying, “Pag pinapasabog po kami sa gabi tumatakbo kaming mag-iina malapit sa wall para mag umpok-umpukan lang po.” Ravelina recounted the hardships she and her family faced due to the Israel-Hamas war, including the lack of water and electricity. “Wala kaming kuryente, wala po kaming tubig. Almost one month sumasandok lang kami sa ilalim ng bahay ng isang building na tinitirhan namin. Doon kami kumukuha,” she said. According to DFA Assistant Secretary Robert Ferrer, upon their arrival, the families went through debriefing sessions to address the trauma they experienced. “May crisis management ang DSWD dito so we have trained psychologists, trained people,” Asec. Ferrer said. Ferrer emphasized that those with families or relatives in the country will be permitted to come home, while those without will be presented with various options through a government program. “Those who have not any connection with the country like wala sila kamag-anak, we will connect them with their LGUs, with their relatives here,” he said. “'Yung wala, we have already informed DSWD and the other agencies about it and we are having an inter-agency process.” Ferrer admitted there are still Filipinos who opted to stay in Gaza despite the volatile situation. “Their own decision po 'yun but we are asking them to change their mind and go home na lang,” Ferrer said.  As of Tuesday, there are a total of 89 Filipinos and their 14 Palestinian spouses who have returned home to the Philippines. A fourth batch of evacuees is expected to arrive Wednesday.",
    "comments": "N, nothing infers criticism or support of the Government repatriating Filipinos from Gaza."
  },
  {
    "article_url": "https://newsinfo.inquirer.net/1713561/marcos-apologizes-for-new-year-flight-cancellations",
    "article_body": "President Ferdinand \"Bongbong\" Marcos Jr. on Friday apologized to the thousands of passengers stranded on New Year’s Day after power outages and a technical glitch led to the cancellations and delays of flights in and out of Manila. “So now, I’m sorry. We, of course, we have to apologize to our kababayans who, especially those who came from abroad because their vacation is limited,” Marcos told reporters in an interview after he inspected Ninoy Aquino International Airport (Naia) Terminal 3. Despite the airport chaos, Marcos believed that airport authorities and his Cabinet officials “have done a reasonably good job,” saying that “six hours is rather a short time considering how much [was] needed to be done to get the system back up into working condition.” ‘Back to normal’ He said operations at Naia were now “back to normal” but he said the Civil Aviation Authority of the Philippines (Caap) must have “a proper backup system” to prevent similar incidents happening in the future. “That’s why we are asking for your forgiveness. But we’ll do everything we can to make sure it doesn’t happen again,” he assured travelers. Proper backup system He ordered Transportation Secretary Jaime Bautista to “fast-track” all negotiations for the upgrade of equipment at the country’s airports. “What I told [Transportation] Secretary Jimmy [Bautista] is to make sure that we fast-track all of—whatever negotiations we have with our—with the equipment suppliers who can help us with the upgrades, for the software and the hardware of our equipment,” he said. “And beyond that, is to have a proper backup system so if the whole system fails, like it did on Jan. 1, we have a complete system ready to go,” he added. On New Year’s Day, about 56,000 passengers were stranded at Naia and other airports in the country after 361 flights to and from Manila were either canceled, diverted or delayed. Both the Senate and the House of Representatives have called for an investigation of the fiasco.",
    "comments": "SBF, the article continuously highlights government response with limited context to what the apology was for."
  },
  {
    "article_url": "https://newsinfo.inquirer.net/1988514/top-officials-ratings-down-in-pulse-asia-survey",
    "article_body": "The approval and trust ratings of both President Marcos and Vice President Sara Duterte declined in the latest Ulat ng Bayan nationwide survey of Pulse Asia. The survey, conducted from Sept. 6 to 13, showed that the President’s approval score dipped by 3 percentage points from 53 percent in June to 50 percent in September. Marcos’ trust rating went down 2 percentage points from 52 percent to 50 percent during the same period. Developments during survey Duterte, on the other hand, experienced significant decreases in approval and trust scores. Her approval score fell by 9 percentage points from 69 percent to 60 percent while her trust score dropped by 10 percentage points from 71 percent to 61 percent during the same period. For other top officials, Senate President Francis Escudero scored a 60-percent approval rating in September. His trust rating dropped by 13 percentage points from 69 percent in June to 56 percent in September. Speaker Martin Romualdez saw his approval rating dipping from 35 percent to 32 percent and his trust rating, from 35 percent to 31 percent. The survey used face-to-face interviews with 2,400 adult respondents and had a margin of error of plus-or-minus 2 percentage points for national estimates and plus-or-minus 4 percentage points for each geographical area. Among the new developments in the weeks leading up to and during the conduct of the survey were the arrest of Apollo Quiboloy, leader and founder of the Kingdom of Jesus Christ; hearings on the budget of the Office of the Vice President and Philippine offshore gaming operators; continuing tensions between the Philippines and China in the West Philippine Sea; and the public backlash over the food poverty threshold released by the National Economic and Development Authority which pegged at P21 per meal the minimum cost of food to meet a person’s micronutrient needs.",
    "comments": "N, it is reporting on statistical decreases in trust and provides key events that may have influenced those scores."
  },
  {
    "article_url": "https://www.rappler.com/philippines/marcos-oics-defense-health/",
    "article_body": "President Ferdinand Marcos Jr said on Thursday, December 1, that the status quo remains in the health and defense departments – two portfolios that are headed by officers-in-charge. “We just go to the process,” said Marcos in a chance interview on Thursday, December 1, when asked for updates on the appointment of officers-in-charge in his Cabinet. “So let’s be patient. Basta’t na… Ako, ang concern ko lang ‘yung kailangang gawin na trabaho, nagagawa? So far naman, nagagawa,” he added. (My concern is that if people are doing their jobs. So far, they’re doing their jobs.) At least three departments or offices headed by a Secretary are occupied by officers-in-charge: the Department of Health, Department of National Defense (DND), and the Office of the Press Secretary. “Wala pa kaming DOH. Wala pa kaming inino-nominate (We don’t have a nominee for DOH yet). Usec. Vergeire is doing a fine job,” said Marcos, referring to Undersecretary Rosario Vergeire, who was designated officer-in-charge weeks after the new administration began took over. Marcos also said he was “happy with the situation [in the DND] as it is now.” The DND administers the country’s military force and the Office of Civil Defense, an agency tasked with civil defense and disaster risk reduction. It is currently headed by former armed forces chief Jose Faustino, designated Senior Undersecretary and Office-in-Charge Still, the President did not rule out changes when 2023 rolls in. “These things are revisited especially every year at the end of the first year. I don’t think that’s any — that’s a secret to anyone that at the end of the first year, ‘yung mga ibang kandidato (the other candidates), they will now join the mix of possible nominees,” he said. There’s another department that critics and allies alike have said needs a full-time post: agriculture, which Marcos holds concurrently. The President has said that he has a checklist of things he wants to accomplish before finding an agri chief, although he did not say what were these goals. Delays and backlogs in permanent appointments – from the heads of major Cabinet posts, middle management in the bureaucracy, and non-Career Executive Service Officer (CESO) occupying CESO posts – is a major sore point in the Marcos administration. His short-lived first executive secretary, Vic Rodriguez, was criticized for being the supposed cause of the delays. Rodriguez, Marcos’ campaign spokesperson during the May elections, has since been kicked out of the President’s party for supposedly failing to accommodate their party-mates in government posts. His replacement, former chief justice Lucas Bersamin, issued a memorandum circular that expanded the powers of these interim appointments, allowing them to enter into new contracts and projects, among others.",
    "comments": "SBA, the later sections of the article divulge into delays and backlogs of permanent appointments even when satisfaction was stated by OICs, as well as highlighting the President’s own occupation of a secretary role."
  },
  {
    "article_url": "https://www.rappler.com/philippines/mindanao/foreshore-land-dispute-stalls-denr-claim-oroquieta/",
    "article_body": "MANILA, Philippines – The Department of Environment and Natural Resources (DENR) is at a standstill in its efforts to collect millions in unpaid foreshore leases from the Oroquieta City government while a court weighs in on a foreshore land ownership dispute it has with the local government. A ruling this week from the Commission on Audit (COA) halted DENR’s claims of over P2.436 million in back rents. The DENR-Northern Mindanao’s petition hinges on seven foreshore lease agreements signed in 2003, granting the city government authority to use foreshore areas across several barangays. City hall, however, ceased payments after the first year, leading to years of accumulating debt, now calculated by the City Environment and Natural Resources Office at over P2.437 million. The legal impasse leaves the foreshore areas – and the funds at stake – in a limbo, awaiting judicial clarification on who truly owns the areas in question. COA Chairperson Gamaliel Cordoba, along with Commissioners Roland Pondoc and Mario Lipana, said the DENR’s claim came prematurely, citing a declaratory relief petition pending before the Oroquieta City Regional Trial Court (RTC) Branch 12. “This Commission dismisses the petition for being premature pending the resolution of the petition for declaratory relief. This claim is prematurely filed and not yet ripe for adjudication by this Commission,” read part of the COA ruling. At the center of the issue lies a legal debate over whether the foreshore areas fall under DENR’s domain or if they were ceded to Oroquieta based on Republic Act 5518, the city’s charter. The foreshore lease contracts, signed on January 31, 2003, covers a foreshore area in barangays Poblacion, Poblacion II Lower Loboc, Tabuc Norte and Sur, Canubay, San Vicente Bajo, and Mobod. Based on the agreements, the city government was supposed to pay an annual rent during a 25-year period. The DENR’s civil case seeks clarity on whether the 1969 legislation, which vests ownership of public lands in Oroquieta City, extends to foreshore areas. The outcome of the case is crucial for the DENR, whose claim was filed with COA in 2021 to compel the local government to fulfill its lease obligations. Oroquieta officials have argued that the RTC ruling on ownership will have to be made first before the contracts become enforceable. For now, COA has dismissed the petition, concluding that any adjudication on DENR’s claims remains “premature pending the resolution” of the court’s decision on ownership. “Apparently, there is an issue as to the ownership of the foreshore area which is already subject of a pending petition for declaratory relief before the RTC-Branch 12. Thus, it is appropriate for the declaratory relief to be resolved first for a judicial determination on the issue of ownership over the foreshore area,” the COA stated. – Rappler.com",
    "comments": "BA, it heavily leans into government mismanagement using words like limbo and standstill, accumulating debt, and premature."
  },
  {
    "article_url": "https://www.rappler.com/philippines/malacanang-response-nsc-retaliafion-claims-alleged-filipino-spies/",
    "article_body": "MANILA, Philippines — Malacañang on Monday, April 7, said there was still “no concrete evidence” to the claim of its own National Security Council (NSC) that China’s detention of three Filipinos for alleged espionage was in “retaliation” against the arrest of Chinese nationals accused of spying in the Philippines. “There is no concrete evidence yet if it is really retaliation or a part of retaliation of the other country. We will not say that because there is no final investigation on that matter. But there is still ongoing investigation on that and we will just defer all the details to DFA (Department of Foreign Affairs) and to (Department of National Defense),” said Undersecretary Claire Castro in a briefing. On April 5, the NSC spokesperson Assistant Director General Jonathan Malaya had said in a statement that the arrest of the three, Palawan locals who had previously been part of a learning exchange with the Chinese province of Hainan, “can be seen as a retaliation for the series of legitimate arrests of Chinese agents and accomplices by Philippine law enforcement and counter-intelligence agencies in recent months.” Beginning January 2025, Philippine law enforcement has publicized the arrest of both Chinese and even Filipino nationals over what investigators claim were acts of espionage against critical Philippine infrastructure, including military bases and waterways. Castro, press briefer for the Palace, said “legal assistance will always be given, all the necessary help and assistance will be provided.” The DFA had earlier said that it had been “formally made aware of the allegations against the three Filipinos who are currently detained in China.” “The Department has conveyed to the Chinese Government to ensure that these allegations are tried with due process and with full respect to the rights of the said Filipinos in accordance with domestic law and the Philippines-China Consular Agreement,” said DFA spokesperson Teresita Daza on April 4. Daza had confirmed in mid-March 2025 that three Palawan locals were under detention in China over allegations of espionage. In early April, China state media reported on the identity and status of the three detained Filipinos. The NSC, in its April 5 statement, said it was “alarmed” by the charges against the three, all former recipients of a Hainan Government Scholarship program created through a sister province arrangement with Palawan. – Rappler.com",
    "comments": "SBF, due to framing arrests by the Philippine government as legitimate and arrests by a foreign government as retaliatory."
  },
  {
    "article_url": "https://www.gmanetwork.com/news/topstories/nation/853532/house-oks-creation-of-virology-and-vaccine-institute-on-final-reading/story/",
    "article_body": "The House of Representatives on Monday approved on third and final reading a bill establishing a Virology and Vaccines Institute of the Philippines (VVIP), one of one of the priority measures of the Marcos administration amid the lingering COVID-19 pandemic. This developed after the measure numbered House Bill 6452 gathered 216 yes votes, zero no votes and zero abstention during Monday’s plenary session. House Bill 6452 provides that the VVIP, which will be an attached agency of the Department of Science and Technology (DOST), will serve as as the premier research and development institute in the field of virology, encompassing all kinds of viruses and viral diseases in plants, animals and humans. Likewise, the measure states that the VVIP will also be a venue for scientists, research institutes and other organizations in the Philippines and abroad, to work collaboratively to study viruses of agricultural, industrial, clinical and environmental importance. In addition, the bill states that the VVIP will focus on the following key science and technology applications: The same bill also allows the VVIP to procure specialized materials, equipment, and services to be used in its operation and administration, in the most expeditious manner, as well as adopt the most suitable or appropriate method of procurement that it deems fit based on its identified needs and requirements depending on the existing conditions and requirements that justify the use of a particular alternative modality provided for by the Government Procurement Reform Act and its 2016 Revised Implementing Rules and Regulations. Albay Representative Joey Salceda of Albay, one of the authors of the measure, earlier said he envisions the VVIP as the Philippines’ version of the Serum Institute of India known for manufacturing effective vaccines, among others. “India continues to be one of the world’s largest manufacturers of COVID vaccines even if it did not originate them, because they have a serum institute. Vietnam solved ASF (African Swine Flu) first because their serum institute invented a vaccine early on,” Salceda said. “The vaccine institute is not merely a health institute. The applications for virology are immense and broad. Food security, forest management, and the development of a strong pharmaceutical sector all benefit from a strong grasp of viruses,” he added. — RSJ, GMA Integrated News",
    "comments": "SBF, because it talks too much about the benefits of the VVIP."
  },
  {
    "article_url": "https://newsinfo.inquirer.net/2048721/new-petition-assails-25-budget-for-low-priority-on-education",
    "article_body": "MANILA, Philippines — Another petition has been filed in the Supreme Court seeking to declare the 2025 General Appropriations Act (GAA) unconstitutional for allegedly circumventing the constitutional directive to allocate the biggest budget to education. The Teachers’ Dignity Coalition, Freedom from Debt Coalition, and the Philippine Alliance of Human Rights Advocates submitted a petition for certiorari and prohibition on Monday, asking the high tribunal to strike down the 2025 GAA, or Republic Act No. 12116, for violating Section 5(5), Article XIV of the Constitution. It mandates that “the State shall assign the highest budgetary priority to education and ensure that teaching will attract and retain its rightful share of the best available talents through adequate remuneration and other means of job satisfaction and fulfillment.”> They also urged the high court to issue a temporary restraining order and a writ of prohibition, directing the President to desist from implementing the 2025 national budget and prohibiting the respondents from disbursing public funds for its enforcement and implementation. Named respondents in the case, docketed as G.R. No. 279199, are President Marcos, Executive Secretary Lucas Bersamin, the Senate, and the House of Representatives. <h2>P1.05-T allocation</h2> Under this year’s national budget of P6.326 trillion, the education sector is receiving the highest allocation at P1.05 trillion. However, the petitioners argued that the education sector’s budget was only significantly increased by aggregating nontraditional education-related funds from various agencies and offices. These included funding for the Philippine Military Academy, the Philippine National Police Academy, the Philippine Public Safety College under the Department of the Interior and Local Government, the Local Government Academy, the National Defense College of the Philippines, and the Philippine Science High School System and the Science Education Institute, both under the Department of Science and Technology. This same argument of “bloating” the education budget was also raised in earlier petitions challenging the 2025 GAA. “The inclusion of noneducation-related spending strays from the functional composition of the education sector, namely the Department of Education, state universities and colleges, the Commission on Higher Education, and the Technical Education and Skills Development Authority, which collectively garnered a combined budget of P913 billion, a poor second to infrastructure,” the petitioners argued. They also cited education data from global and national institutions revealing that “education in the country is in crisis.” “Never before has there been a more unjust and callous national budget in this country. The petitioners, thus, urgently implore this honorable Supreme Court to correct this gross injustice,” they said.",
    "comments": "SBA, talks about government misuse of the Education Budget and alleges funds allocated to DepEd may be used for other purposes."
  },
  {
    "article_url": "https://www.rappler.com/philippines/philhealth-single-confinement-rule-scrapped-beginning-october-2024/",
    "article_body": "MANILA, Philippines –The Philippine Health Insurance Corporation (PhilHealth) said its single confinement policy (SPC) has already been scrapped. PhilHealth Executive Vice President Eli Santos told senators on Wednesday, October 2, that the policy shift took effect on October 1 even though the circular has yet to be published publicly. “This will take effect October 1, 2024, Mr. Chairperson, and the policy will be published on October 7, 2024. This will have a retroactive effect effective October 1, 2024,” Santos told the Senate joint committees on health and demography and finance. The “single period of confinement (SPC) rule” provided that beneficiaries who are confined due to an illness can only be covered by PhilHealth once within a 90-day period. This leaves patients to fend for themselves in case they get readmitted for the same illness. PhilHealth corporate affairs vice president Rey Baleña said those who will pay for the cost of a readmission from October 1 to 6 are entitled to reimbursements. This applies to public and private health facilities. “Readmissions starting October 1 this year will be covered by this lifting of the SPC rule,” Baleña told Rappler in a text message. “At any rate, we will not deny claims affected. Paglabas ng circular (When the circular is released) and the system for this, all affected claims will be paid accordingly.” He added that the state health insurer already called for an emergency meeting with the country’s hospital groups to inform them of the policy change ahead of time. PhilHealth’s benefits committee (BenCom) had recommended on September 24 to scrap the policy. The recommendation was then adopted by the state insurer’s board of directors on September 27. “We complied with our promise to lift the rule on single period of confinement,” Santos said. Data from the DOH show that the controversial policy led to the denial of 26,750 claims in 2023. Most of the cases for readmission included community acquired pneumonia, acute gastroenteritis, urinary tract infection, and chronic kidney disease, among other illnesses. To be again covered by PhilHealth, some patients were advised to change their diagnosis or reason for hospital admission. – Rappler.com",
    "comments": "SBF, even though the agency was responsible for rolling the measure out, the timeline and breach of protocol to cancel a controversial measure paints the view that the Government can break its own rules for the welfare of citizens."
  },
  {
    "article_url": "https://www.gmanetwork.com/news/topstories/nation/941223/ph-team-sent-to-myanmar-self-sustaining-for-two-weeks-herbosa/story/",
    "article_body": "The first batch of the Philippine contingent that was sent to Myanmar to provide assistance following a devastating magnitude 7.7 earthquake will be able to sustain itself in the next two weeks, Health Secretary Ted Herbosa said Tuesday. Of the 91 Filipino volunteers, Herbosa said 32 came from the DOH Philippine Emergency Medical Assistance Team (PEMAT), who were certified by the World Health Organization (WHO). This batch’s PEMAT, which came from the Eastern Visayas Medical Center, is composed of doctors, nurses, medical technologists, pharmacists, midwives, nursing attendants, and administrative, logistics, and technical staff. “Usually ang kanilang equipment, self-sustaining, good for two weeks. Kung kailangan mag-extend, magre-resupply tayo or magpapalit,” Herbosa said in a \"Balitanghali\" interview. (Usually their equipment is self-sustaining and is good for two weeks. If their stay there needs to be extended, we have to resupply or replace them with another team.) \"That’s why meron tayong two other teams na naka-standby para hindi masyadong matagal ang ating mga volunteer doctors and nurses doon sa isang disaster area,” he added. (That's why we have two other teams on standby so that our volunteer doctors and nurses won't have to spend a long time in a disaster area.) Aside from the medical team, the Philippine contingent for the Myanmar mission also consists of urban search and rescue teams from the Philippine Army, Philippine Air Force, Bureau of Fire Protection, Metropolitan Manila Development Authority, Department of Environment and Natural Resources, and the private sector (EDC and APEX Mining). The death toll in Myanmar following the magnitude 7.7 earthquake last March 28 has reached 2,065, according to state media. More than 3,900 were injured and at least 270 were missing. There were four Filipinos who were also reportedly unaccounted for. — Giselle Ombay/BAP, GMA Integrated News",
    "comments": "SBF, lists many Government agencies involved in efforts in Myanmar but doesn’t give importance to the effects in Myanmar itself."
  },
  {
    "article_url": "https://news.abs-cbn.com/news/2024/3/10/9-filipino-crew-members-of-seized-tanker-back-in-ph-1808",
    "article_body": "MANILA (UPDATED) -- Nine Filipino crew members of an oil tanker seized by Iran's navy in the Gulf of Oman arrived in the Philippines on Sunday. Lord Rangasajo, one of the crew members who arrived, said they had positive interactions with the Iranians. \"Maganda naman po ang pakikiharap ng mga Iranian sa amin. Wala naman po kaming naging problema,\" he said. He also mentioned that they were not harassed.  \"Mga eight commandos, they boarded us with the heavy guns but okay naman sila,\" he said. The Department of Foreign Affairs revealed that two more are expected to return this week. \"'Yung dalawang aalis pa, Tuesday or Wednesday aalis sila,\" DFA Usec. Eduardo de Vega said. (Two more will depart on Tuesday or Wednesday.) The remaining six are awaiting replacements before returning to the Philippines.  \"Hindi naman sila hostage per se, kasi kusang loob silang naiwan doon dahil binigyan ng double salary kaya out of their own free will sila na naiwan doon,\" he said. (They are not hostages per se because they willingly stayed there due to the double salary offered, so they chose to remain voluntarily.) In an interview on Bagong Pilipinas Ngayon on Monday, De Vega said the crew are healthy and happy to be back in the country. The nine seafarers were able to return after they were replaced by Russian counterparts. “Ang kailangan na lang diyan mapalitan sila ng ibang crew men. Kasi ang sabi ng port authority sa Iran at saka ng manning agency, puwede namang umuwi kahit sino basta palitan sila kasi kailangan nagpapatakbo ng barko. Originally naisip nila Filipino rin ang kukunin eh hindi bakit kukuha eh di pareho din magkakaroon pa ng mga Filipinong ipit doon. Kaya ang sabi namin dapat ibang bansa,” De Vega explained.  (What is needed is for them to be replaced by other crew men. The port authority in Iran and the manning agency said anyone can come home so long as they are replaced because a ship operator is needed. What they originally thought was to get other Filipinos but that would put them in a pickle as well. That’s why we said it should be another nationality.) “‘Yung sahod nila tuloy pa, binabayaran sila ng manning agency pero ang pagbayad dito sa pamilya dito sa Pilipinas. At ang sabi ng Department of Migrant Workers, ang nakikipag-ugnayan sa manning agency, pinaakyat pa nga ang suweldo,” De Vega said. (They continued to receive their salary, but this was paid to their family here in the Philippines. The Department of Migrant Workers who is coordinating with the manning agency, said the pay was actually increased.) The Overseas Workers Welfare Administration (OWWA) assured they are ready to provide psychocounseling to arriving seafarers, along with financial assistance accommodation, and air fare if they need to return to their provinces. \"Kakausapin po muna natin sila kung magdecide sila na magse-settle sila rito sa Pilipinas then we will provide reintegration sa kanila,\" OWWA Deputy Administrator Atty. Honey Quiño said.  (We will first discuss with them if they decide to settle in the Philippines, and then we will provide reintegration support.) The Filipino crew members were under Iran's custody following the Iranian Navy's seizure of the oil tanker St. Nikolas in the Gulf of Oman in January. Iran's action was a retaliatory response to the confiscation of Iranian crude oil from the same vessel by US forces in 2023. -- With a report from Victoria Tulad, ABS-CBN News.",
    "comments": "N, it doesn’t overstate the DMW’s role in the release and return of the Filipino sailors."
  },
  {
    "article_url": "https://www.gmanetwork.com/news/topstories/nation/854915/afp-marks-87th-anniversary/story/",
    "article_body": "The Armed Forces of the Philippines (AFP) on Monday marked its 87th founding anniversary in a ceremony held at Camp Aguinaldo in Quezon City. President Ferdinand “Bongbong” Marcos Jr. attended the celebration for the first time as the commander-in-chief of the armed forces. He was joined by AFP Chief-of-Staff Bartolome Bacarro, Department of Defense officer-in-charge Jose Faustino Jr., Ilocos Norte 1st District Representative Sandro Marcos, and other government officials and foreign dignitaries. Marcos also led the conferment of awards on military officers, civilians, and organizations who had great contributions to the AFP. During his speech, Bacarro vowed to sustain the government’s gains in the country’s internal and external security including decreasing the communists' terrorist groups’ capability and the modernization of the AFP assets. “International security operations are of prime importance to ensure the safety and security of our citizens against spoilers of peace and lawless elements,” said Bacarro. “On this front, we can confidently state that we have achieved strategic victory and it is inching closer towards victory against terrorism. Our localized peace-building efforts with a multi-stakeholder and whole-of-nation approach also yielded positive results that encouraged enemies of the state to return to the fold of the law and build goodwill with communities,” he said. Bacarro also said the AFP has strengthened its external ties with the Philippines’ partner countries in the ASEAN, the Indo-Pacific Region, and other nations. “We also conducted training, military exchanges, and joint combined exercises. These opportunities allowed us to learn from our international counterparts, have our voice heard on the global stage, and conduct defense diplomacy purposely and rationally,” he said. Further, the military official thanked the President and Vice President Sara Duterte for their trust and support, saying they can count “on the same zeal and commitment from the AFP in ensuring the safety, the integrity and the security” in the country. “Soon, we will unveil a new campaign plan, a plan that will assist in setting the stage for the attainment of genuine unity, synergy, and peace for our country. As we look forward to the dawn of the new year, rest assured that we will remain hard at work operationally and strategically in sustaining our gains made these years,” he said. “We all witnessed the AFP accomplish an inordinate amount of good work, thus this has been an uncommonly good year for the AFP,” he added. — BM, GMA Integrated News",
    "comments": "BF, heavily leans into Government statements that talk about decreasing of threats, improved military ties, and calls for an uncommonly good year while thanking other Government agencies and executives including the President and Vice President."
  }
]


